app/controllers/emails_controller.rb

  def all_emails
    @email_all = Email.all
---
SELECT  "emails".* FROM "emails" ORDER BY "emails"."id" ASC LIMIT ?  [["LIMIT", 1]]